public class TextTask {
//    Задание, ответ в текстовой форме:
//    Дана скобочная последовательность: [((())()(())]]
//            - Можно ли считать эту последовательность правильной?
//            - Если ответ на предыдущий вопрос “нет”, то что необходимо в ней изменить, чтоб она стала правильной?
//
//
//    Нет, последовательность не является правильной, есть лишние скобки, правильно будет вероятнее всего так [(())()(())]
//            (то есть каждая открытая скобка должна закрываться такой же)
}
